app/Http/Controllers/Admin/DashboardController.php

    public function index()
    {
        $stores = Store::select('id', 'name')->get();
---
select `id`, `name` from `stores` where `stores`.`deleted_at` is null