app/Http/Controllers/Admin/SystemSettingController.php

select `id`, `name`, `description`, `version`, `frontend`, `backend`, `system_photo_path`, `system_logo_path`, `website`, `facebook`, `twitter`, `instagram`, `youtube`, `line`, `opening_date` from `system_settings` limit 1
---
    public function index()
    {
        return Inertia::render('Admin/Settings/SystemSettings/Show', [
            'systemSetting' => SystemSetting::select('id', 'name', 'description', 'version', 'frontend', 'backend', 'system_photo_path', 'system_logo_path', 'website', 'facebook', 'twitter', 'instagram', 'youtube', 'line', 'opening_date')->first(),
        ]);